# 第7章 数据清洗和准备

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
#等价于
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
#对于DataFrame,dropna默认丢弃任何含有缺失值的⾏
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
#传⼊how='all'将只丢弃全为NA的那些⾏
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
#⽤这种⽅式丢弃列，只需传⼊axis=1即可
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
#丢弃列，只需传⼊axis=1
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  0.738568       NaN       NaN
1 -0.105320       NaN       NaN
2 -1.709194       NaN  1.395155
3 -0.378618       NaN -1.308460
4  0.009500  1.373550 -0.810563
5  0.957665  0.568865  0.388204
6 -0.185587 -0.596148 -0.004361

In [14]:
df.dropna()

          0         1         2
4  0.009500  1.373550 -0.810563
5  0.957665  0.568865  0.388204
6 -0.185587 -0.596148 -0.004361

In [15]:
df.dropna(thresh=2)

          0         1         2
2 -1.709194       NaN  1.395155
3 -0.378618       NaN -1.308460
4  0.009500  1.373550 -0.810563
5  0.957665  0.568865  0.388204
6 -0.185587 -0.596148 -0.004361

In [16]:
df.fillna(0)

          0         1         2
0  0.738568  0.000000  0.000000
1 -0.105320  0.000000  0.000000
2 -1.709194  0.000000  1.395155
3 -0.378618  0.000000 -1.308460
4  0.009500  1.373550 -0.810563
5  0.957665  0.568865  0.388204
6 -0.185587 -0.596148 -0.004361

In [17]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.738568  0.500000  0.000000
1 -0.105320  0.500000  0.000000
2 -1.709194  0.500000  1.395155
3 -0.378618  0.500000 -1.308460
4  0.009500  1.373550 -0.810563
5  0.957665  0.568865  0.388204
6 -0.185587 -0.596148 -0.004361

In [18]:
_ = df.fillna(0, inplace=True)
#fillna默认会返回新对象，但也可以对现有对象进⾏就地修改

In [19]:
df

          0         1         2
0  0.738568  0.000000  0.000000
1 -0.105320  0.000000  0.000000
2 -1.709194  0.000000  1.395155
3 -0.378618  0.000000 -1.308460
4  0.009500  1.373550 -0.810563
5  0.957665  0.568865  0.388204
6 -0.185587 -0.596148 -0.004361

In [20]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.416192 -0.457903  1.689153
1  0.176557 -1.448093 -0.653921
2  0.788410       NaN  0.910034
3  1.127863       NaN  0.431791
4 -1.343409       NaN       NaN
5  0.072159       NaN       NaN

In [21]:
df.fillna(method='ffill')

          0         1         2
0 -0.416192 -0.457903  1.689153
1  0.176557 -1.448093 -0.653921
2  0.788410 -1.448093  0.910034
3  1.127863 -1.448093  0.431791
4 -1.343409 -1.448093  0.431791
5  0.072159 -1.448093  0.431791

In [22]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.416192 -0.457903  1.689153
1  0.176557 -1.448093 -0.653921
2  0.788410 -1.448093  0.910034
3  1.127863 -1.448093  0.431791
4 -1.343409       NaN  0.431791
5  0.072159       NaN  0.431791

In [23]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [24]:
#移除重复数据
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [25]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [26]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [27]:
data['v1'] = range(7)
data.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [28]:
#uplicated和drop_duplicates默认保留的是第⼀个出现的值组合。传⼊keep='last'则保留最后⼀个
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [29]:
#映射
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
 'ounces': [4, 3, 12, 6, 7.5, 8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [30]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [31]:
lowercased=data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [32]:
data['animal']=lowercased.map(meat_to_animal)

In [33]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
#其他方式
data['food'].map(lambda x :meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [35]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [38]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
 data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

重命名轴索引

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'],
    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [41]:
transform=lambda x: x[:4].upper()

In [42]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [43]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [44]:
data.rename(index=str.title,columns=str.upper)#不是修改原始数据

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [45]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [46]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [47]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

离散化和分箱

In [48]:
bins = [18, 25, 35, 60, 100]
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [49]:
cats=pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [50]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [51]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [52]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [53]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [54]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [55]:
data = np.random.rand(20)
cats=pd.cut(data,4,precision=2)#等长的箱
cats

[(0.039, 0.28], (0.28, 0.52], (0.039, 0.28], (0.76, 1.0], (0.28, 0.52], ..., (0.76, 1.0], (0.76, 1.0], (0.28, 0.52], (0.28, 0.52], (0.28, 0.52]]
Length: 20
Categories (4, interval[float64]): [(0.039, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 1.0]]

In [56]:
pd.value_counts(cats)

(0.28, 0.52]     6
(0.76, 1.0]      5
(0.039, 0.28]    5
(0.52, 0.76]     4
dtype: int64

In [57]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)#点一样多
cats

[(0.629, 3.543], (-3.044, -0.742], (0.629, 3.543], (-3.044, -0.742], (0.629, 3.543], ..., (-0.742, -0.0377], (-0.0377, 0.629], (-0.0377, 0.629], (-0.742, -0.0377], (0.629, 3.543]]
Length: 1000
Categories (4, interval[float64]): [(-3.044, -0.742] < (-0.742, -0.0377] < (-0.0377, 0.629] < (0.629, 3.543]]

In [58]:
pd.value_counts(cats)

(0.629, 3.543]       250
(-0.0377, 0.629]     250
(-0.742, -0.0377]    250
(-3.044, -0.742]     250
dtype: int64

In [59]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.211, 3.543], (-3.044, -1.323], (-0.0377, 1.211], (-1.323, -0.0377], (1.211, 3.543], ..., (-1.323, -0.0377], (-0.0377, 1.211], (-0.0377, 1.211], (-1.323, -0.0377], (1.211, 3.543]]
Length: 1000
Categories (4, interval[float64]): [(-3.044, -1.323] < (-1.323, -0.0377] < (-0.0377, 1.211] < (1.211, 3.543]]

检测和过滤异常值

In [60]:
data=pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001619    -0.003797    -0.022629    -0.024058
std       1.002430     0.989820     1.032189     0.993963
min      -3.290020    -3.044105    -3.667222    -3.248910
25%      -0.672257    -0.673793    -0.701678    -0.666838
50%       0.034230    -0.005492    -0.024830    -0.025349
75%       0.646956     0.637799     0.711153     0.624273
max       3.336684     3.906385     3.800153     3.077446

In [61]:
col=data[2]
col[np.abs(col)>3]

62    -3.667222
66    -3.245090
831    3.800153
Name: 2, dtype: float64

In [62]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
62   0.451459  0.714414 -3.667222  0.224113
66  -1.572517  0.839509 -3.245090  1.385193
179 -0.777920  3.019137 -1.600773  0.452388
229  0.765011 -0.794885 -0.278317  3.020684
296 -0.068514  0.076597  0.411849  3.077446
306 -0.721492  3.906385  1.907037  0.908646
378  0.732341  0.574043 -0.633230 -3.248910
601  3.336684 -0.256628 -1.121677 -0.330369
638  1.037550 -0.792056 -0.416850 -3.141262
650 -3.274679  0.543159  1.671236  0.084031
695 -3.290020 -0.107388  0.492298 -0.672974
768  0.899777  3.271644 -0.663174  0.788859
772  1.016911 -3.044105 -0.901064  0.590025
788  3.102593  0.709480  0.317849 -0.025079
831  0.627589  0.421584  3.800153  1.081258
991 -3.107025  2.413665  1.021203  0.439954

In [63]:
data[np.abs(data)>3]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.001386    -0.004950    -0.022517    -0.023766
std       0.998949     0.985586     1.026639     0.992449
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.672257    -0.673793    -0.701678    -0.666838
50%       0.034230    -0.005492    -0.024830    -0.025349
75%       0.646956     0.637799     0.711153     0.624273
max       3.000000     3.000000     3.000000     3.000000

In [64]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0 -1.0 -1.0  1.0
2 -1.0 -1.0 -1.0  1.0
3 -1.0 -1.0  1.0 -1.0
4 -1.0  1.0  1.0  1.0

置换

In [65]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [66]:
sampler = np.random.permutation(5)
sampler

array([2, 1, 3, 0, 4])

In [67]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [68]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [69]:
df.sample(n=10,replace=True)

    0   1   2   3
4  16  17  18  19
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
2   8   9  10  11
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

计算指标/哑变量

In [70]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [71]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [72]:
dummies=pd.get_dummies(df["key"],prefix='key')
df_with_dummy=df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [73]:
#MovieLens 1M数据集实例
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',header=None, names=mnames)

C:\Users\Feiyang\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

In [74]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [75]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres=pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [76]:
#构建⼀个全零DataFrame
zero_matrix=np.zeros((len(movies),len(genres)))

In [77]:
dummies=pd.DataFrame(zero_matrix,columns=genres)

In [78]:
gen=movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [79]:
dummies.columns.get_indexer(gen.split("|"))

array([0, 1, 2], dtype=int64)

In [80]:
for i ,gen in enumerate(movies.genres):
    indices=dummies.columns.get_indexer(gen.split("|"))
    dummies.iloc[i,indices]=1

In [81]:
movies_windic=movies.join(dummies.add_prefix("genres"))
movies_windic.iloc[:3]

,movie_id,title,genres,genresAnimation,genresChildren's,genresComedy,genresAdventure,genresFantasy,genresRomance,genresDrama,...,genresCrime,genresThriller,genresHorror,genresSci-Fi,genresDocumentary,genresWar,genresMusical,genresMystery,genresFilm-Noir,genresWestern
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [82]:
#get_dummies和cut
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [83]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [84]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

 字符串操作

In [85]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [86]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [87]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [88]:
'::'.join(pieces)

'a::b::guido'

In [89]:
'guido' in val

True

In [90]:
val.index(',')

1

In [91]:
val.find(':')
#find和index的区别：如果找不到字符串，index将会引发⼀个异常（⽽不是返回－1）

-1

In [92]:
val.count(',')

2

In [93]:
val.replace(',', '::')

'a::b:: guido'

正则表达式

In [94]:
import re

In [95]:
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [96]:
regex = re.compile('\s+')#编译以得到⼀个可重⽤的regex对象
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [97]:
#得到匹配regex的所有模式
regex.findall(text)

[' ', '\t ', ' \t']

In [98]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [99]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [100]:
m=regex.search(text)
m

In [101]:
text[m.start():m.end()]

'dave@google.com'

In [102]:
print(regex.match(text))

None

In [103]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [104]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex=re.compile(pattern,flags=re.IGNORECASE)

In [105]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [106]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [107]:
print(regex.sub(r'Username:\1,Domain:\2,Suffix:\3',text))

Dave Username:dave,Domain:google,Suffix:com
Steve Username:steve,Domain:gmail,Suffix:com
Rob Username:rob,Domain:gmail,Suffix:com
Ryan Username:ryan,Domain:yahoo,Suffix:com

In [108]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [109]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [110]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [111]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [112]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [113]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [114]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [115]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [116]:
data.str[1]

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [117]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object